# 3. Тоо таах тоглоом
# Даалгавар: Програм нь санамсаргүй тоо үүсгэж, хэрэглэгчээс уг 
# тоог таахыг хүснэ. Хэрэглэгчийн оруулсан тоог хэт бага эсвэл 
# хэт их гэж хариу өгнө.
# Зорилго: Санамсаргүй тоо үүсгэх болон while давталт, нөхцөл 
# шалгах операторуудтай танилцах.

import random

nuutsToo = random.randint(1, 100)

while True:
    taasanToo = int(input("1-100 хооронд тоо таа: "))

    if taasanToo < nuutsToo:
        print("Хэт бага байна!")

    elif taasanToo > nuutsToo:
        print("Хэт их байна!")

    else:
        print("Зөв таалаа!")
        break
