# Жагсаалтын утгуудыг оролт болгон авах sum_list функц зохиоё. 
def sum_list(items):
    #Нийлбэрийн утга хадгалах 'sum_numbers'-д 0-д хадгална.
    sum_numbers = 0
    # Жагсаалтаас "х"-н утгыг нэг нэгээр нь уншина
    for x in items:
        # "х"-н утгыг нийлбэр хадгалах хувьсагчийн утга дээр нэмнэ
        sum_numbers += x
    # Жагсаалтын утгуудын нийлбэрийг буцаана
    return sum_numbers

#[1, 2, -8] жагсаалтын утгуудыг функц дотроо дуудаж нийлбэрийн утгыг хэвлэнэ.
print("Жагсаалтын утгуудын нийлбэр: ",sum_list([1,2,8]))
